Tekla Open API Reference for Tekla Structures 2025
ReportTemplateElement Constructor (TemplateInfo)
 Creates a new report template element instance with the given template.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReportTemplateElement(
	TemplateInfo Template
)
Public Sub New (
	Template As TemplateInfo
)
Parameters
Template
Type: Tekla.Structures.Drawing.TemplateInfo
The template to be used.
See Also
Reference
ReportTemplateElement Class
ReportTemplateElement Overload
Tekla.Structures.Drawing Namespace